IT3G/constant/DragProperties_example
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      DragProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

GidaspowErgunWenyu on;

GidaspowSchillerNaumann off;

Gibilaro off;

GidaspowErgunWenyuCoeffs
{
      alphaG              15; //150;   
      betaG               1.75;
}

GeneralCoeffs
{
      gammaCoeff          0;
}

// ************************************************************************* //
