IT3G/constant/waveDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

waveType        irregular;

genAbs          1;

absDir          0.0;

nPaddles        1;

wavePeriods
1000
(
9.980040e+00
9.940358e+00
9.900990e+00
9.861933e+00
9.823183e+00
9.784736e+00
9.746589e+00
9.708738e+00
9.671180e+00
9.633911e+00
9.596929e+00
9.560229e+00
9.523810e+00
9.487666e+00
9.451796e+00
9.416196e+00
9.380863e+00
9.345794e+00
9.310987e+00
9.276438e+00
9.242144e+00
9.208103e+00
9.174312e+00
9.140768e+00
9.107468e+00
9.074410e+00
9.041591e+00
9.009009e+00
8.976661e+00
8.944544e+00
8.912656e+00
8.880995e+00
8.849558e+00
8.818342e+00
8.787346e+00
8.756567e+00
8.726003e+00
8.695652e+00
8.665511e+00
8.635579e+00
8.605852e+00
8.576329e+00
8.547009e+00
8.517888e+00
8.488964e+00
8.460237e+00
8.431703e+00
8.403361e+00
8.375209e+00
8.347245e+00
8.319468e+00
8.291874e+00
8.264463e+00
8.237232e+00
8.210181e+00
8.183306e+00
8.156607e+00
8.130081e+00
8.103728e+00
8.077544e+00
8.051530e+00
8.025682e+00
8.000000e+00
7.974482e+00
7.949126e+00
7.923930e+00
7.898894e+00
7.874016e+00
7.849294e+00
7.824726e+00
7.800312e+00
7.776050e+00
7.751938e+00
7.727975e+00
7.704160e+00
7.680492e+00
7.656968e+00
7.633588e+00
7.610350e+00
7.587253e+00
7.564297e+00
7.541478e+00
7.518797e+00
7.496252e+00
7.473842e+00
7.451565e+00
7.429421e+00
7.407407e+00
7.385524e+00
7.363770e+00
7.342144e+00
7.320644e+00
7.299270e+00
7.278020e+00
7.256894e+00
7.235890e+00
7.215007e+00
7.194245e+00
...
);

waveHeights
1000
(
3.226901e-29
8.797958e-29
2.351715e-28
6.165892e-28
1.586395e-27
4.007020e-27
9.940590e-27
2.423057e-26
5.805659e-26
1.367876e-25
3.170410e-25
7.231356e-25
1.623742e-24
3.590550e-24
7.821694e-24
1.679121e-23
3.553420e-23
7.415358e-23
1.526417e-22
3.100282e-22
6.215029e-22
1.230053e-21
2.404165e-21
4.641760e-21
8.855114e-21
1.669594e-20
3.112021e-20
5.735820e-20
1.045620e-19
1.885730e-19
3.365201e-19
5.943811e-19
1.039287e-18
1.799346e-18
3.085261e-18
5.240282e-18
8.818372e-18
1.470539e-17
2.430524e-17
3.982339e-17
6.469474e-17
1.042240e-16
1.665360e-16
2.639747e-16
4.151461e-16
6.478770e-16
1.003470e-15
1.542773e-15
2.354775e-15
3.568693e-15
5.370844e-15
8.028035e-15
1.191976e-14
1.758226e-14
2.576834e-14
3.752814e-14
5.431750e-14
7.814243e-14
1.117504e-13
1.588826e-13
2.246038e-13
3.157324e-13
4.413963e-13
6.137499e-13
8.488907e-13
1.168028e-12
1.598963e-12
2.177954e-12
2.952060e-12
3.982058e-12
5.346071e-12
7.144056e-12
9.503319e-12
1.258527e-11
1.659367e-11
2.178460e-11
2.847861e-11
3.707516e-11
4.807015e-11
6.207663e-11
7.984954e-11
1.023149e-10
1.306045e-10
1.660962e-10
2.104611e-10
2.657195e-10
3.343043e-10
4.191357e-10
5.237066e-10
6.521812e-10
8.095073e-10
1.001545e-09
1.235214e-09
1.518657e-09
1.861429e-09
2.274708e-09
2.771530e-09
3.367059e-09
...
);

wavePhases
1000
(
2.620227e+00
4.525932e+00
7.186382e-04
1.899612e+00
9.220945e-01
5.801805e-01
1.170307e+00
2.171222e+00
2.492964e+00
3.385485e+00
2.633877e+00
4.305361e+00
1.284611e+00
5.517375e+00
1.720813e-01
4.212672e+00
2.622003e+00
3.510352e+00
8.820771e-01
1.244708e+00
5.031227e+00
6.083767e+00
1.969302e+00
4.349991e+00
5.506515e+00
5.620979e+00
5.343485e-01
2.453884e-01
1.067076e+00
5.517532e+00
6.179314e-01
2.645897e+00
6.018597e+00
3.349976e+00
4.347192e+00
1.982443e+00
4.313413e+00
5.244108e+00
1.149086e-01
4.713296e+00
6.213197e+00
4.700863e+00
1.762082e+00
4.959188e+00
6.485881e-01
2.814198e+00
5.708874e+00
1.844832e+00
1.808146e+00
8.169936e-01
1.216862e-01
4.265249e+00
1.329699e+00
1.668479e+00
3.088645e+00
3.352868e-01
3.607287e+00
9.219228e-01
3.702716e+00
4.396711e+00
6.429862e-01
2.601590e+00
4.363045e+00
2.602365e+00
3.138668e-01
3.367136e+00
4.170745e+00
3.235144e+00
5.935064e+00
3.685434e+00
5.676242e+00
8.637790e-01
8.750991e-01
5.072989e+00
2.498677e+00
1.038951e+00
5.827708e+00
2.185077e+00
4.717492e+00
4.561580e+00
5.549976e+00
3.918648e+00
4.718310e+00
2.192193e+00
1.696007e+00
5.629019e+00
2.689776e+00
6.062269e+00
4.168526e+00
3.906229e+00
7.209702e-01
5.965817e+00
2.826881e+00
3.634129e+00
2.564399e+00
1.489284e+00
5.676101e+00
3.604535e+00
...
);

waveDirs
1000{ 0 };

// ************************************************************************* //